app/controllers/agent_properties_controller.rb

SELECT `property_values`.* FROM `property_values` WHERE `property_values`.`agent_property_id` = 8
---
  def show
    @values = PropertyValue.where(:agent_property_id => params[:id])

SELECT `agent_properties`.* FROM `agent_properties` WHERE `agent_properties`.`agent_id` IS NULL
---
  def xml_errors
    @xml_with_errors = AgentProperty.where(:agent_id => nil)