app/controllers/agents_controller.rb

  def index
    @agents = Agent.all
---
SELECT `agents`.* FROM `agents`

  def show
    @agent = Agent.find(params[:id])
---
SELECT `agents`.* FROM `agents` WHERE `agents`.`id` = 9 LIMIT 1